'''print("12月份衣服销售报表")
print("日期，服装名称，价格/件，库存数量，销售量/每日")
print("1号	羽绒服	253.6	500	10")
print("2号	牛仔裤	86.3	600	60")
print("3号	风衣	96.8	335	43")
print("4号	皮草	135.9	855	63")
print("5号	T血	65.8	632	63")
print("6号	衬衫	49.3	562	120")
print("7号	牛仔裤	86.3	600	72")
print("8号	羽绒服	253.6	500	69")
print("9号	牛仔裤	86.3	600	35")
print("10号	羽绒服	253.6	500	140")
print("11号	牛仔裤	86.3	600	90")
print("12号	皮草	135.9	855	24")
print("13号	T血	65.8	632	45")
print("14号	风衣	96.8	335	25")
print("15号	牛仔裤	86.3	600	60")
print("16号	T血	65.8	632	129")
print("17号	羽绒服	253.6	500	10")
print("18号	风衣	96.8	335	43")
print("19号	T血	65.8	632	63")
print("20号	牛仔裤	86.3	600	60")
print("21号	皮草	135.9	855	63")
print("22号	风衣	96.8	335	60")
print("23号	T血	65.8	632	58")
print("24号	牛仔裤	86.3	600	140")
print("25号	T血	65.8	632	48")
print("26号	风衣	96.8	335	43")
print("27号	皮草	135.9	855	57")
print("28号	羽绒服	253.6	500	10")
print("29号	T血	65.8	632	63")
print("30号	风衣	96.8	335	78")'''
# print(253.6*10+86.3*60+96.8*43+135.9*63+65.8*63+49.3*120+86.3*72+253.6*69+86.3*35+253.6*140+86.3*90+135.9*24+65.8*45+96.8*25+86.3*60+65.8*129+253.6*10+96.8*43+65.8*63+86.3*60+135.9*63+96.8*60+65.8*58+86.3*140+65.8*48+96.8*43+135.9*57+253.6*10+65.8*63+96.8*78)
"""print('''1号	羽绒服	253.6	500	10
2号	牛仔裤	86.3	600	60
3号	风衣	96.8	335	43
4号	皮草	135.9	855	63
5号	T血	65.8	632	63
6号	衬衫	49.3	562	120
7号	牛仔裤	86.3	600	72
8号	羽绒服	253.6	500	69
9号	牛仔裤	86.3	600	35
10号	羽绒服	253.6	500	140
11号	牛仔裤	86.3	600	90
12号	皮草	135.9	855	24
13号	T血	65.8	632	45
14号	风衣	96.8	335	25
15号	牛仔裤	86.3	600	60
16号	T血	65.8	632	129
17号	羽绒服	253.6	500	10
18号	风衣	96.8	335	43
19号	T血	65.8	632	63
20号	牛仔裤	86.3	600	60
21号	皮草	135.9	855	63
22号	风衣	96.8	335	60
23号	T血	65.8	632	58
24号	牛仔裤	86.3	600	140
25号	T血	65.8	632	48
26号	风衣	96.8	335	43
27号	皮草	135.9	855	57
28号	羽绒服	253.6	500	10
29号	T血	65.8	632	63
30号	风衣	96.8	335	78
''')"""
import pandas as oo
data = oo.DataFrame(oo.read_excel("12月份衣服销售数据.xlsx",header=0,))
data['price']= data["价格/件"]*data["销售量/每日"]
print('总销售额---{0:.2f}'.format(data['price'].sum()))
aver = data["销售量/每日"].sum()/data['price'].count()
print('日销售量---{0:2f}'.format(aver))
print(data['销售量/每日'].groupby(data['服装名称']).sum())
sales = oo.DataFrame(data['销售量/每日'].groupby(data['服装名称']).sum())
print(sales)
sales['ratio/占比'] = sales['销售量/每日'] / sales['销售量/每日'].sum()*100
sales['ratio/占比'] = sales['ratio/占比'].apply(lambda x:format(x, '.2%'))
print(sales)


